{
  "twitter": [
    {
      "post": "🚀 Introducing RepSpheres: AI that does your sales research in 60 seconds. 95% confidence scoring. 3x more qualified meetings. Try Canvas free: https://canvas.repspheres.com #SalesIntelligence #AI #MedicalDeviceSales",
      "timing": "10:00 AM EST"
    },
    {
      "post": "Sales reps spend 40% of their time on research. What if AI could do it in 60 seconds? RepSpheres Canvas module is live with 95% accuracy in doctor research. Free tier available! 🎯 #SalesTech #B2B",
      "timing": "2:00 PM EST"
    },
    {
      "post": "Beta users report: 85% less time researching, 40% more deals closed. That's the RepSpheres difference. See how AI is transforming medical device sales: https://repspheres.com 🏥💡",
      "timing": "5:00 PM EST"
    }
  ],
  "linkedin": {
    "main": "Excited to announce the launch of RepSpheres! 🎯\n\nWe're transforming sales intelligence with AI that:\n• Researches prospects in 60 seconds\n• Achieves 95% confidence scoring\n• Identifies buying signals automatically\n• Generates personalized approach strategies\n\nMedical device sales teams using our Canvas module report 85% less time researching and 40% more closed deals.\n\nDiscover the future of sales intelligence: https://repspheres.com\n\n#SalesEnablement #ArtificialIntelligence #MedTech #B2BSales #SalesIntelligence",
    "followUp": "Want to see RepSpheres in action? Here's what happens when you input a doctor's name:\n\n1️⃣ NPI verification (instant)\n2️⃣ Website discovery & analysis\n3️⃣ Review aggregation from multiple sources\n4️⃣ Competitive landscape mapping\n5️⃣ AI-generated sales brief with approach strategy\n\nAll in under 60 seconds. No more hours on Google.\n\nTry it free: https://canvas.repspheres.com"
  },
  "facebook": "Big news! RepSpheres is officially live! 🚀 We're using AI to revolutionize how sales teams research prospects. No more hours on Google - get complete prospect intelligence in 60 seconds. Medical device reps are already seeing 3x more qualified meetings. Check out our Canvas module: https://canvas.repspheres.com",
  "reddit": {
    "r/sales": "Just launched RepSpheres - AI that researches your prospects in 60 seconds\n\nHey r/sales! After seeing reps waste hours on prospect research, we built RepSpheres. Our Canvas module uses AI to:\n\n- Verify doctor NPIs instantly\n- Analyze their websites\n- Aggregate reviews\n- Map local competition\n- Generate personalized approach strategies\n\nBeta users report 85% less research time and 3x more qualified meetings. Free tier available for individual reps.\n\nWould love your feedback: https://canvas.repspheres.com",
    "r/medicaldevicesales": "New AI tool achieving 95% accuracy in doctor research - looking for feedback\n\nBuilt specifically for medical device sales. RepSpheres Canvas analyzes everything from practice websites to patient reviews, identifies expansion signals, and generates approach strategies.\n\nOne implant rep closed 40% more deals in their first month using it. Free to try: https://canvas.repspheres.com"
  }
}